src/common/wsdl/device/hello.wsdl

<soap:Envelope 
    xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
    xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:wsd="http://schemas.xmlsoap.org/ws/2005/04/discovery"
    xmlns:wsdp="http://schemas.xmlsoap.org/ws/2006/02/devprof"
    xmlns:tdn="http://www.onvif.org/ver10/network/wsdl"
>
    <soap:Header>
        <wsa:To>urn:schemas-xmlsoap-org:ws:2005:04:discovery</wsa:To>
        <wsa:Action>http://schemas.xmlsoap.org/ws/2005/04/discovery/Hello</wsa:Action>
        <wsa:MessageID>urn:uuid:__MESSAGE_ID__</wsa:MessageID>
        <wsa:ReplyTo>
            <wsa:Address>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:Address>
        </wsa:ReplyTo>
        <wsd:AppSequence InstanceId="1742155307" MessageNumber="1"></wsd:AppSequence>
    </soap:Header>
    <soap:Body>
        <wsd:Hello>
            <wsa:EndpointReference>
                <wsa:Address>urn:__ADDRESS__</wsa:Address>
            </wsa:EndpointReference>
            <wsd:Types>wsdp:Device tdn:NetworkVideoTransmitter</wsd:Types>
            <wsd:Scopes>onvif://www.onvif.org/name onvif://www.onvif.org/Profile/Streaming</wsd:Scopes>
            <wsd:XAddrs>__XADDRS__</wsd:XAddrs>
            <wsd:MetadataVersion>1</wsd:MetadataVersion>
        </wsd:Hello>
    </soap:Body>
</soap:Envelope>